Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://vigneshviggi.github.io/blood-bank-management-system"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load Test (100 VUs / 1 min)"
  defaults:
    headers:
      User-Agent: "Artillery-Performance-Test"
      Accept: "application/json, text/html"

scenarios:
  - name: "Public Browsing & Search Flow"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/api/camps"
      - think: 1
      - get:
          url: "/api/donors"
